Revit 2027 API
ParameterTypeId.AnalyticalModelRotation Property
 "Cross-Section Rotation": The rotation of Analytical Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelRotation { get; }
Public Shared ReadOnly Property AnalyticalModelRotation As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelRotation {
	ForgeTypeId^ get ();
}
static member AnalyticalModelRotation : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace